app/views/contents/_show_contents_inside_courses_in_content_index.html.erb

SELECT "contents".* FROM "contents" INNER JOIN "contents_courses" ON "contents"."id" = "contents_courses"."content_id" WHERE "contents_courses"."course_id" = ?  [["course_id", 4]]
---
           <td>--Contents showed below--</td>
           <% course.contents.each do |content| %>