app/views/contents/show.html.erb


<% if Content.exists?(name: params[:name]) %>
---
SELECT  "contents".* FROM "contents" WHERE "contents"."name" = ? LIMIT ?  [["name", "4"], ["LIMIT", 1]]
SELECT  1 AS one FROM "contents" WHERE "contents"."name" = ? LIMIT ?  [["name", "4"], ["LIMIT", 1]]