app/views/users/_show_contents_inside_courses_in_users_page.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = ?  [["user_id", 5]]
---
<tbody>
    <% current_user.courses.each do |course| %>

SELECT "contents".* FROM "contents" INNER JOIN "contents_courses" ON "contents"."id" = "contents_courses"."content_id" WHERE "contents_courses"."course_id" = ?  [["course_id", 4]]
---

           <% course.contents.each do |content| %>