app/views/users/_show_courses_in_users_page.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
    <% current_user.courses.each do |course| %>