app/views/courses/_edit_contents_in_courses_page.html.erb

  <tbody>
    <% course.contents.each do |content| %>
---
SELECT "contents".* FROM "contents" INNER JOIN "contents_courses" ON "contents"."id" = "contents_courses"."content_id" WHERE "contents_courses"."course_id" = ?  [["course_id", 8]]