app/controllers/contents_controller.rb

SELECT "users".* FROM "users"
SELECT "courses".* FROM "courses"
SELECT "contents".* FROM "contents"
SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses_users"."course_id" = "courses"."id" INNER JOIN "users" ON "users"."id" = "courses_users"."user_id" WHERE "course_id"."user_id" = 5
SELECT "users".* FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?  [["course_id", 4]]
SELECT "contents".* FROM "contents" INNER JOIN "contents_courses" ON "contents"."id" = "contents_courses"."content_id" WHERE "contents_courses"."course_id" = ?  [["course_id", 4]]
---
  def index
    @users = User.all
    @courses = Course.all
    @allcontents = Content.all
    @usercourses = Course.includes(:users)
    @current_user_courses = current_user.courses.includes(:contents)

SELECT  "contents".* FROM "contents" WHERE "contents"."name" = ? LIMIT ?  [["name", "4"], ["LIMIT", 1]]
---
  def show
      @contentshow = Content.find_by(name: params[:name])

SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "contents".* FROM "contents" WHERE "contents"."name" = ? LIMIT ?  [["name", "content1"], ["LIMIT", 1]]
---
  def preview

    #@contentinpreview = Content.find(params[:content_id])
          if Content.exists?(id: params[:id])
        @contentinpreview = Content.find(params[:id])
      else
        @contentinpreview = Content.find_by(name: params[:id])

UPDATE "contents" SET "name" = ?, "updated_at" = ? WHERE "contents"."id" = ?  [["name", "Content1"], ["updated_at", 2017-05-12 03:49:46 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @content.update(content_params)

DELETE FROM "contents" WHERE "contents"."id" = ?  [["id", 1]]
---
  def destroy
    @content.destroy

SELECT  "contents".* FROM "contents" WHERE (content1) LIMIT ?  [["LIMIT", 1]]
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "contents".* FROM "contents" WHERE "contents"."name" = ? LIMIT ?  [["name", "4"], ["LIMIT", 1]]
---
    def set_content
      #if Content.exists?(name: params[:name])
      if Content.exists?(id: params[:id])
        @content = Content.find(params[:id])
      else
        @content = Content.find_by(name: params[:id])