app/controllers/courses_controller.rb

SELECT "users".* FROM "users"
SELECT "courses".* FROM "courses"
SELECT "contents".* FROM "contents"
---
  def index
    @users = User.all
    @courses = Course.all
    @contents = Content.all

UPDATE "courses" SET "name" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "Course3 onlyfor student1"], ["updated_at", 2017-03-30 14:13:50 UTC], ["id", 6]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)