app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "courses".* FROM "courses"
SELECT "contents".* FROM "contents"
---
  def index
    @users = User.all
    @courses = Course.all
    @contents = Content.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @targetuser = User.find(params[:id])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "role" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "admin"], ["password_digest", "$2a$10$jlm5FX8OHxz88LXM01SYn.yzniA2zJ14iZrr4hYKGIUpV20po.Vmy"], ["updated_at", 2017-03-30 08:28:35 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)